"""
Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
"""

my_list = [-2, None, 35, 'Word', False, 3.14]
for i in my_list:
    print(f'{i} is {type(i)}')